# GetLoops Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..GetLoops Method
BoundaryConditions Class See Also
---
Returns curve loops that define geometry of the area boundary conditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<CurveLoop> GetLoops()
```

Visual Basic
---
```text
Public Function GetLoops As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetLoops()
```

# ### Return Value
The curve loop collection.
# Remarks
Boundary conditions should be BoundaryConditionsType::Area type. Otherwise exception is thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Area type. |

# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace